app/controllers/login_controller.rb

SELECT * FROM `demands` WHERE (`demands`.user_id = 12) ORDER BY created_at desc LIMIT 5
SELECT * FROM `offers` WHERE (`offers`.user_id = 12) ORDER BY created_at desc LIMIT 5
---
  def index
    @demands = Demand.find(:all, :conditions => ["status_id <> ?", Status::Demand::NEW], :order => "created_at desc", :limit => 5)
    #current_user = User.find(session[:user_id])
    @my_demands = @current_user.demands.find(:all, :order => "created_at desc", :limit => 5)
    @offers = Offer.find(:all, :conditions => ["demand_id in (?)", @my_demands.map{|d| d.id}.join(",")], :limit => "10", :order => "created_at desc")