app/controllers/welcome_controller.rb

INSERT INTO `companies` (`name`, `created_at`, `updated_at`, `name_in_demand`, `status_id`) VALUES('firma', '2009-09-30 21:47:50', '2009-09-30 21:47:50', '', 11)
---
  def create_company
    @company = Company.new(params[:company])

    begin
        @company.transaction do
          @user = User.new(params[:user])

          @company.save!